xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxSrc_reg.h
/** \brief B30, DPLL Service Request 12 */
#define SRC_GTM_DPLL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B30u)
/** Alias (User Manual Name) for SRC_GTM_DPLL12.
* To use register names with standard convension, please use SRC_GTM_DPLL12.
*/
#define SRC_GTMDPLL12 (SRC_GTM_DPLL12)

/** \brief B34, DPLL Service Request 13 */
#define SRC_GTM_DPLL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B34u)
/** Alias (User Manual Name) for SRC_GTM_DPLL13.
* To use register names with standard convension, please use SRC_GTM_DPLL13.
*/
#define SRC_GTMDPLL13 (SRC_GTM_DPLL13)

/** \brief B38, DPLL Service Request 14 */
#define SRC_GTM_DPLL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B38u)
/** Alias (User Manual Name) for SRC_GTM_DPLL14.
* To use register names with standard convension, please use SRC_GTM_DPLL14.
*/
#define SRC_GTMDPLL14 (SRC_GTM_DPLL14)

/** \brief B3C, DPLL Service Request 15 */
#define SRC_GTM_DPLL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B3Cu)
/** Alias (User Manual Name) for SRC_GTM_DPLL15.
* To use register names with standard convension, please use SRC_GTM_DPLL15.
*/
#define SRC_GTMDPLL15 (SRC_GTM_DPLL15)

/** \brief B40, DPLL Service Request 16 */
#define SRC_GTM_DPLL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B40u)
/** Alias (User Manual Name) for SRC_GTM_DPLL16.
* To use register names with standard convension, please use SRC_GTM_DPLL16.
*/
#define SRC_GTMDPLL16 (SRC_GTM_DPLL16)

/** \brief B44, DPLL Service Request 17 */
#define SRC_GTM_DPLL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B44u)
/** Alias (User Manual Name) for SRC_GTM_DPLL17.
* To use register names with standard convension, please use SRC_GTM_DPLL17.
*/
#define SRC_GTMDPLL17 (SRC_GTM_DPLL17)

/** \brief B48, DPLL Service Request 18 */
#define SRC_GTM_DPLL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B48u)
/** Alias (User Manual Name) for SRC_GTM_DPLL18.
* To use register names with standard convension, please use SRC_GTM_DPLL18.
*/
#define SRC_GTMDPLL18 (SRC_GTM_DPLL18)

/** \brief B4C, DPLL Service Request 19 */
#define SRC_GTM_DPLL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B4Cu)
/** Alias (User Manual Name) for SRC_GTM_DPLL19.
* To use register names with standard convension, please use SRC_GTM_DPLL19.
*/
#define SRC_GTMDPLL19 (SRC_GTM_DPLL19)

/** \brief B50, DPLL Service Request 20 */
#define SRC_GTM_DPLL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B50u)
/** Alias (User Manual Name) for SRC_GTM_DPLL20.
* To use register names with standard convension, please use SRC_GTM_DPLL20.
*/
#define SRC_GTMDPLL20 (SRC_GTM_DPLL20)

/** \brief B54, DPLL Service Request 21 */
#define SRC_GTM_DPLL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B54u)
/** Alias (User Manual Name) for SRC_GTM_DPLL21.
* To use register names with standard convension, please use SRC_GTM_DPLL21.
*/
#define SRC_GTMDPLL21 (SRC_GTM_DPLL21)

/** \brief B58, DPLL Service Request 22 */
#define SRC_GTM_DPLL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B58u)
/** Alias (User Manual Name) for SRC_GTM_DPLL22.
* To use register names with standard convension, please use SRC_GTM_DPLL22.
*/
#define SRC_GTMDPLL22 (SRC_GTM_DPLL22)

/** \brief B5C, DPLL Service Request 23 */
#define SRC_GTM_DPLL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B5Cu)
/** Alias (User Manual Name) for SRC_GTM_DPLL23.
* To use register names with standard convension, please use SRC_GTM_DPLL23.
*/
#define SRC_GTMDPLL23 (SRC_GTM_DPLL23)

/** \brief B60, DPLL Service Request 24 */
#define SRC_GTM_DPLL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B60u)
/** Alias (User Manual Name) for SRC_GTM_DPLL24.
* To use register names with standard convension, please use SRC_GTM_DPLL24.
*/
#define SRC_GTMDPLL24 (SRC_GTM_DPLL24)

/** \brief B64, DPLL Service Request 25 */
#define SRC_GTM_DPLL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B64u)
/** Alias (User Manual Name) for SRC_GTM_DPLL25.
* To use register names with standard convension, please use SRC_GTM_DPLL25.
*/
#define SRC_GTMDPLL25 (SRC_GTM_DPLL25)

/** \brief B68, DPLL Service Request 26 */
#define SRC_GTM_DPLL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B68u)
/** Alias (User Manual Name) for SRC_GTM_DPLL26.
* To use register names with standard convension, please use SRC_GTM_DPLL26.
*/
#define SRC_GTMDPLL26 (SRC_GTM_DPLL26)

/** \brief B70, Error Service Request */
#define SRC_GTM_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B70u)
/** Alias (User Manual Name) for SRC_GTM_ERR.
* To use register names with standard convension, please use SRC_GTM_ERR.
*/
#define SRC_GTMERR (SRC_GTM_ERR)

/** \brief B90, TIM0 Shared Service Request 0 */
#define SRC_GTM_TIM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B90u)
/** Alias (User Manual Name) for SRC_GTM_TIM0_0.
* To use register names with standard convension, please use SRC_GTM_TIM0_0.
*/
#define SRC_GTMTIM00 (SRC_GTM_TIM0_0)

/** \brief B94, TIM0 Shared Service Request 1 */
#define SRC_GTM_TIM0_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B94u)
/** Alias (User Manual Name) for SRC_GTM_TIM0_1.
* To use register names with standard convension, please use SRC_GTM_TIM0_1.
*/
#define SRC_GTMTIM01 (SRC_GTM_TIM0_1)

/** \brief B98, TIM0 Shared Service Request 2 */
#define SRC_GTM_TIM0_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B98u)
/** Alias (User Manual Name) for SRC_GTM_TIM0_2.
* To use register names with standard convension, please use SRC_GTM_TIM0_2.
*/
#define SRC_GTMTIM02 (SRC_GTM_TIM0_2)

/** \brief B9C, TIM0 Shared Service Request 3 */
#define SRC_GTM_TIM0_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B9Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM0_3.
* To use register names with standard convension, please use SRC_GTM_TIM0_3.
*/
#define SRC_GTMTIM03 (SRC_GTM_TIM0_3)

/** \brief BA0, TIM0 Shared Service Request 4 */
#define SRC_GTM_TIM0_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA0u)
/** Alias (User Manual Name) for SRC_GTM_TIM0_4.
* To use register names with standard convension, please use SRC_GTM_TIM0_4.
*/
#define SRC_GTMTIM04 (SRC_GTM_TIM0_4)

/** \brief BA4, TIM0 Shared Service Request 5 */
#define SRC_GTM_TIM0_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA4u)
/** Alias (User Manual Name) for SRC_GTM_TIM0_5.
* To use register names with standard convension, please use SRC_GTM_TIM0_5.
*/
#define SRC_GTMTIM05 (SRC_GTM_TIM0_5)

